app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params.merge! user_id: current_user.id)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Hammer"], ["image", "http://s.hswstatic.com/gif/hammer-1.jpg"], ["created_at", "2015-06-11 23:38:57.167133"], ["updated_at", "2015-06-11 23:38:57.167133"]]